content/posts/org.org
#+TITLE: Org Cheat Shell
#+author:    ST-Saint
#+email:     st.saint.wyy@gmail.com
#+layout: cheatsheet
#+SETUPFILE: /home/yayu/org/org-html-themes/org/theme-readtheorg-local.setup

* configuration
- reveal.js
#+begin_src org
#+REVEAL_THEME: Serif
#+end_src

- all
#+begin_src org
#+OPTIONS: broken-links:t \n:t
#+LATEX_HEADER: \hypersetup{colorlinks=true,linkcolor=black}
#+SETUPFILE: /home/yayu/org/org-html-themes/org/theme-readtheorg-local.setup
#+end_src


- 连接
  #+begin_src org
  #+OPTIONS: broken-links:t \n:t
  #+end_src
- 换行
  #+begin_src org
  #+OPTIONS: \n:t
  #+end_src

- TOC 颜色
  #+begin_src org
#+LATEX_HEADER: \hypersetup{colorlinks=true,linkcolor=black}
  #+end_src
- HTML theme
  #+begin_src org
#+SETUPFILE: /home/yayu/org/org-html-themes/org/theme-readtheorg-local.setup
  #+end_src

* fonts
** Emphasis and Monospace
1. *bold*
2. /italic/
3. _underlined_
4. =verbatim=
5. ~code~
6. +strike-through+

* open
- 快速打开文件
  #+begin_src emacs-lisp
("<SPC> n f" '+default/find-in-notes)
  #+end_src

* capture
- capture 文件位置加入 org 文档
#+begin_src emacs-lisp :tangle yes
("<SPC> X" 'org-capture)
("C-c C-w" 'refile)
#+end_src

[[file:~/org/org.org::*capture][capture]]

* link
** 插入链接
#+begin_src emacs-lisp :tangle yes
("<SPC> m l l" 'org-insert-link)
#+end_src
** 编辑连接
#+begin_src emacs-lisp
("C-c '" 'org-edit-special)
("C-C C-l" 'org-insert-link)
#+end_src
** 图片
- 调整图片大小
#+begin_src org
#+attr_html: :width 1000px
#+end_src

* Code Snippet
** edit
进入模式编辑
#+begin_src emacs-lisp
("C-c '" 'org-edit-special)
#+end_src

** execute
#+begin_src emacs-lisp
("C-c C-c" 'org-ctrl-c-ctrl-c)
#+end_src

[[file:~/Project/Cpp/test.cpp][cpp test file]]

* agenda
** open agenda
#+begin_src emacs-lisp
("<SPC> o A" 'org-agenda)
#+end_src

** pomodoro
- start
#+begin_src emacs-lisp
("<SPC> p m" 'org-pomodoro)
("C-c p m" 'org-pomodoro)
#+end_src

- recent task
#+begin_src emacs-lisp :tangle yes
("<SPC> n o" 'org-clock-goto)
#+end_src


** time

*** 插入时间
#+begin_src emacs-lisp
("C-c ." 'org-time-stamp)
("<SPC> m d t" 'org-time-stamp)
#+end_src
*** time range
1. in one day

#+begin_src org
<2021-06-06 Sun 18:00-20:00>
#+end_src
2. cross days
#+begin_src org
<2021-06-06 Sun>--<2021-06-08 Tue>
#+end_src
3. evaluate time range
#+begin_src emacs-lisp
("<SPC> m c t" 'org-evaluate-time-range)
#+end_src
